app/Models/ModelUsuario.php

public function obtenerUsuarios($data){
$Usuario= $this->db->table('t_usuario');
$Usuario->where($data);
return $Usuario->get()->getResultArray();
---
SELECT *
FROM `t_usuario`
WHERE `usuario` = 'aviles'